

def pda_show_menu():
    print("""
    ╔══════════════════════════════════════╗
    ║                                      ║
    ║           PDA ΕΣΤΙΑΤΟΡΙΟΥ            ║
    ║          ΣΥΣΤΗΜΑ ΔΙΑΧΕΙΡΙΣΗΣ         ║
    ║                                      ║
    ╠══════════════════════════════════════╣
    ║  1. Προβολή καταλόγου                ║
    ║  2. Νέα παραγγελία                   ║
    ║  3. Προβολή παραγγελίας              ║
    ║  4. Προσθήκη προϊόντος               ║
    ║  5. Αφαίρεση προϊόντος               ║
    ║  6. Υπολογισμός λογαριασμού          ║
    ║  7. Επιλογή τρόπου πληρωμής          ║
    ║  8. Στοιχεία τραπεζιού               ║
    ║  9. Προβολή τραπεζιών                ║
    ║ 10. Κλείσιμο τραπεζιού               ║
    ║                                      ║
    ╠══════════════════════════════════════╣
    ║  0. Έξοδος                           ║
    ╚══════════════════════════════════════╝
    """)


def pda_show_table_menu():
    print("""
    ╔══════════════════════════════════════╗
    ║                                      ║
    ║            PDA ΕΣΤΙΑΤΟΡΙΟΥ           ║
    ║          ΚΑΤΑΛΟΓΟΣ ΠΡΟΪΟΝΤΩΝ         ║
    ║                                      ║
    ╠══════════════════════════════════════╣
    ║  1. Ελληνική σαλάτα          7.50€   ║
    ║  2. Τζατζίκι                 4.00€   ║
    ║  3. Πατάτες τηγανητές        4.50€   ║
    ║  4. Πίτα γύρος χοιρινός      4.00€   ║
    ║  5. Μπιφτέκι με πατάτες     10.50€   ║
    ║  6. Cheeseburger             9.50€   ║
    ║  7. Coca-Cola 330 ml         2.00€   ║
    ║  8. Νερό 500 ml              0.50€   ║
    ║                                      ║
    ╚══════════════════════════════════════╝
    """)

items = [
    "Ελληνική σαλάτα 7.50€",
    "Τζατζίκι 4.00€",
    "Πατάτες τηγανητές 4.50€",
    "Πίτα γύρος χοιρινός 4.00€",
    "Μπιφτέκι με πατάτες 10.50€",
    "Cheeseburger 9.50€",
    "Coca-Cola 330 ml 2.00€",
    "Νερό 500 ml 0.50€"
]

price = [
    7.50,
    4.00,
    4.50,
    4.00,
    10.50,
    9.50,
    2.00,
    0.50
]

tables = [
    [["Ελληνική σαλάτα 7.50€"], [], []],
    [[], [], []],
    [[], [], []]
]

payments_meth = [
    [["Κάρτα"], ["Χωρίς τρόπο πληρωμής"], ["Χωρίς τρόπο πληρωμής"]],
    [["Χωρίς τρόπο πληρωμής"], ["Χωρίς τρόπο πληρωμής"], ["Χωρίς τρόπο πληρωμής"]],
    [["Χωρίς τρόπο πληρωμής"], ["Χωρίς τρόπο πληρωμής"], ["Χωρίς τρόπο πληρωμής"]]
]

tables_money = [
    [7.50, 0.0, 0.0],
    [0.0, 0.0, 0.0],
    [0.0, 0.0, 0.0]
]

